# ItemsCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..ItemsCount Property
RebarContainer Class See Also
---
The count of Items in this Rebar Container.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int ItemsCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ItemsCount As Integer
	Get
```

Visual C++
---
```text
public:
property int ItemsCount {
	int get ();
}
```

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace